tap "hashicorp/tap"
tap "homebrew/bundle"
tap 'homebrew/cask'
tap 'homebrew/core'
tap "jumppad-labs/repo"
# Distributed revision control system
brew "git"
# Ping-like tool for HTTP requests
brew "httping"
# Platform built on V8 to build network applications
brew "node"
brew 'python@3.10'
# Distributed revision control system
brew "git"
# UNIX shell (command interpreter)
brew "zsh"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Terraform
brew "hashicorp/tap/terraform"
brew "jumppad-labs/repo/jumppad"
# Reimagine your terminal
cask "fig"
cask 'google-chrome'
cask 'visual-studio-code'
cask 'spotify'
cask 'slack'
cask 'docker'
cask 'figma'
cask 'notion'
cask 'iterm2'
cask 'awscli'
